In [34]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder

In [35]:
raw_data = pd.read_csv('data/bankadditionalfull.csv', sep=',', index_col=0)
raw_data.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,basic.4y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
1,57,services,married,high.school,unknown,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
2,37,services,married,high.school,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
3,40,admin.,married,basic.6y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0
4,56,services,married,high.school,no,no,yes,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,0

In [36]:
def identify_categorical(dataframe):   # Finds categorical data from the dataframe
    total = dataframe.columns
    numerical = dataframe._get_numeric_data().columns
    return list(set(total) - set(numerical))

In [37]:
categorical = identify_categorical(raw_data)

for columns in categorical:
    le = LabelEncoder()
    le.fit(raw_data[columns])
    raw_data[columns] = le.transform(raw_data[columns])
    del(le)

raw_data.head(3)

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,3,1,0,0,0,0,1,6,1,...,1,999,0,1,1.1,93.994,-36.4,4.857,5191.0,0
1,57,7,1,3,1,0,0,1,6,1,...,1,999,0,1,1.1,93.994,-36.4,4.857,5191.0,0
2,37,7,1,3,0,2,0,1,6,1,...,1,999,0,1,1.1,93.994,-36.4,4.857,5191.0,0

In [40]:
# Saving the file
raw_data.to_csv('data/bankadditionalfull_.csv', index=False)

In [41]:
# Now upload the bankadditionalfull_.csv to AWS S3 Bucket and follow the Medium post.